Repository: xjpz/uPic
Catalog: uPic/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, ru, zh_hans, zh_hant

source: The configuration file is invalid, please check!
de: Die Konfigurationsdatei ist ungültig, bitte überprüfen!
es: ¡El archivo de configuración no es válido, por favor verifique!
fr: Le fichier de configuration est invalide, veuillez vérifier!
it: Il file di configurazione non è valido, per favore controlla!
ja: 設定ファイルが無効です、確認してください!
ko: 구성 파일이 유효하지 않습니다, 확인해 주세요!
ru: Файл конфигурации недействителен, пожалуйста, проверьте!
zh_hans: 配置文件无效, 请检查!
zh_hant: 配置文件無效, 請檢查!

source: The configuration has been imported, please check and use!
de: Die Konfiguration wurde importiert, bitte überprüfen und verwenden!
es: ¡La configuración ha sido importada, por favor revise y use!
fr: La configuration a été importée, veuillez vérifier et utiliser!
it: La configurazione è stata importata, per favore controlla e usa!
ja: 設定がインポートされました、確認して使用してください!
ko: 구성이 가져와졌습니다, 확인하고 사용해 주세요!
ru: Конфигурация была импортирована, пожалуйста, проверьте и используйте!
zh_hans: 图床配置已导入, 请检查并使用!
zh_hant: 圖床配置已導入, 請檢查並使用!

source: The current upload task is not complete
de: Der aktuelle Upload-Vorgang ist nicht abgeschlossen
es: La tarea de carga actual no está completa
fr: La tâche de téléchargement actuelle n'est pas terminée
it: L'attività di caricamento corrente non è completa
ja: 現在のアップロードタスクは完了していません
ko: 현재 업로드 작업이 완료되지 않았습니다
ru: Текущая задача загрузки не завершена
zh_hans: 当前上传任务还未结束!
zh_hant: 當前上傳列隊尚未結束!

source: The export was successful, plaese do not send the log to others!
de: Der Export war erfolgreich, bitte senden Sie das Log nicht an andere!
es: ¡La exportación fue exitosa, por favor no envíe el registro a otros!
fr: L'export a réussi, veuillez ne pas envoyer le journal à d'autres!
it: L'esportazione è riuscita, non inviare il log ad altri!
ja: エクスポートは成功しました、ログを他の人に送らないでください!
ko: 내보내기가 성공했으니, 로그를 다른 사람에게 보내지 마세요!
ru: Экспорт прошел успешно, пожалуйста, не отправляйте лог другим!
zh_hans: 导出完成，请勿将日志发送给其他人！
zh_hant: 導出完成，請勿將日誌發送給其他人！

source: The file does not exist or has been deleted!
de: Die Datei existiert nicht oder wurde gelöscht!
es: ¡El archivo no existe o ha sido eliminado!
fr: Le fichier n'existe pas ou a été supprimé!
it: Il file non esiste o è stato eliminato!
ja: ファイルが存在しないか、削除されました!
ko: 파일이 존재하지 않거나 삭제되었습니다!
ru: Файл не существует или был удален!
zh_hans: 复制的文件不存在或已被删除!
zh_hant: 複製的文件不存在或已被刪除!

source: The file will be uploaded anonymously to
de: Die Datei wird anonym hochgeladen zu
es: El archivo se subirá anónimamente a
fr: Le fichier sera téléchargé anonymement vers
it: Il file verrà caricato anonimamente su
ja: ファイルは匿名でアップロードされます:
ko: 파일이 익명으로 업로드됩니다:
ru: Файл будет загружен анонимно на
zh_hans: 文件将匿名上传至
zh_hant: 文件將匿名上傳至

source: The path to the URL field in Response JSON
de: Der Pfad zum URL-Feld im Response JSON
es: La ruta al campo URL en el Response JSON
fr: Le chemin vers le champ URL dans le Response JSON
it: Il percorso al campo URL nel Response JSON
ja: Response JSON内のURLフィールドへのパス
ko: Response JSON에서 URL 필드로의 경로
ru: Путь к полю URL в Response JSON
zh_hans: 返回 JSON 中的 URL 字段的路径
zh_hant: 返回 JSON 中的 URL 字段的路徑

source: There is a problem with the map bed configuration, please check!
de: Es gibt ein Problem mit der Map-Bed-Konfiguration, bitte überprüfen!
es: ¡Hay un problema con la configuración del mapa, por favor verifique!
fr: Il y a un problème avec la configuration de la carte, veuillez vérifier!
it: C'è un problema con la configurazione della mappa, per favore controlla!
ja: マップベッドの設定に問題があります、確認してください!
ko: 맵 베드 구성에 문제가 있습니다, 확인해 주세요!
ru: Есть проблема с конфигурацией карты, пожалуйста, проверьте!
zh_hans: 图床配置存在问题, 请检查!
zh_hant: 圖床配置存在問題, 請檢查!

# Total paths count
source: Total of {count} file paths and urls
de: Gesamte Pfadanzahl
es: Total count de rutas
fr: Nombre total de chemins
it: Numero totale di percorsi
ja: 総パス数
ko: 총 경로 수
ru: Общее количество путей
zh_hans: 共 {count} 个文件路径和链接
zh_hant: 共 {count} 個文件路徑和鏈接

# Turn off error message output
source: Turn off error message output, and output the original file path after the file upload fails
de: Fehlermeldungsausgabe ausschalten
es: Desactivar salida de mensajes de error
fr: Désactiver la sortie des messages d'erreur
it: Disattiva output messaggi di errore
ja: エラーメッセージ出力をオフにする
ko: 오류 메시지 출력 끄기
ru: Отключить вывод сообщений об ошибках
zh_hans: 关闭错误信息输出, 并且在文件上传失败后输出原文件路径
zh_hant: 關閉錯誤信息輸出, 並且在文件上傳失敗後輸出原文件路徑

source: Unsupported file type
de: Nicht unterstützter Dateityp
es: Tipo de archivo no compatible
fr: Type de fichier non pris en charge
it: Tipo di file non supportato
ja: サポートされていないファイルタイプ
ko: 지원되지 않는 파일 유형
ru: Неподдерживаемый тип файла
zh_hans: 不支持的文件类型
zh_hant: 不支持的文件類型

source: Upload failed
de: Upload fehlgeschlagen
es: Error al subir
fr: Échec du téléchargement
it: Caricamento fallito
ja: アップロードに失敗しました
ko: 업로드 실패
ru: Ошибка загрузки
zh_hans: 上传失败
zh_hant: 上傳失敗

source: Upload failed, please check the configuration!
de: Upload fehlgeschlagen, bitte überprüfen Sie die Konfiguration!
es: Error al subir, ¡por favor revise la configuración!
fr: Échec du téléchargement, veuillez vérifier la configuration!
it: Caricamento fallito, per favore controlla la configurazione!
ja: アップロードに失敗しました。設定を確認してください！
ko: 업로드 실패, 구성을 확인하세요!
ru: Ошибка загрузки, пожалуйста, проверьте конфигурацию!
zh_hans: 上传失败, 请检查配置!
zh_hant: 上傳失敗, 請檢查配置!

source: Upload from screenshot
de: Von Screenshot hochladen
es: Subir desde captura de pantalla
fr: Télécharger depuis capture d'écran
it: Carica da screenshot
ja: スクリーンショットからアップロード
ko: 스크린샷에서 업로드
ru: Загрузить со скриншота
zh_hans: 截图上传
zh_hant: 截圖並上傳

source: Upload selected files via uPic
de: Ausgewählte Dateien über uPic hochladen
es: Subir archivos seleccionados vía uPic
fr: Télécharger les fichiers sélectionnés via uPic
it: Carica file selezionati tramite uPic
ja: 選択したファイルをuPicでアップロード
ko: uPic로 선택한 파일 업로드
ru: Загрузить выбранные файлы через uPic
zh_hans: 用 uPic 上传所选文件
zh_hant: 用 uPic 上傳所選文件

source: Upload via uPic
de: Über uPic hochladen
es: Subir vía uPic
fr: Télécharger via uPic
it: Carica tramite uPic
ja: uPicでアップロード
ko: uPic로 업로드
ru: Загрузить через uPic
zh_hans: 使用 uPic 上传
zh_hant: 使用 uPic 上傳

source: Uploaded successfully
de: Erfolgreich hochgeladen
es: Subido exitosamente
fr: Téléchargement réussi
it: Caricato con successo
ja: アップロード成功
ko: 업로드 성공
ru: Успешно загружено
zh_hans: 上传成功
zh_hant: 上傳成功

source: URL has been copied to the clipboard, paste and use it!
de: URL wurde in die Zwischenablage kopiert, fügen Sie sie ein und verwenden Sie sie!
es: ¡La URL ha sido copiada al portapapeles, péguela y úsela!
fr: L'URL a été copiée dans le presse-papiers, collez-la et utilisez-la!
it: L'URL è stata copiata negli appunti, incollala e usala!
ja: URLがクリップボードにコピーされました。貼り付けて使用してください！
ko: URL이 클립보드에 복사되었습니다. 붙여넣어 사용하세요!
ru: URL скопирован в буфер обмена, вставьте и используйте его!
zh_hans: URL 已复制到剪切板, 快去粘贴使用吧!
zh_hant: URL 已複製到剪貼板, 快去貼上使用吧!

source: URL Path
de: URL-Pfad
es: Ruta URL
fr: Chemin URL
it: Percorso URL
ja: URLパス
ko: URL 경로
ru: Путь URL
zh_hans: URL 路径
zh_hant: URL 路徑

source: Use Base64
de: Base64 verwenden
es: Usar Base64
fr: Utiliser Base64
it: Usa Base64
ja: Base64を使用
ko: Base64 사용
ru: Использовать Base64
zh_hans: 使用 Base64
zh_hant: 使用 Base64

source: Username
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
ru: Имя пользователя
zh_hans: 用户名
zh_hant: 用戶名

source: Validate
de: Validieren
es: Validar
fr: Valider
it: Valida
ja: 検証
ko: 검증
ru: Проверить
zh_hans: 验证
zh_hant: 驗證

source: Warning
de: Warnung
es: Advertencia
fr: Avertissement
it: Avvertenza
ja: 警告
ko: 경고
ru: Предупреждение
zh_hans: 提醒
zh_hant: 提醒

# weibo.quality.mw690
source: medium size
de: mittelgroß
es: tamaño mediano
fr: taille moyenne
it: dimensione media
ja: 中サイズ
ko: 중간 크기
ru: средний размер
zh_hans: 中等大小
zh_hant: 中等大小

# weibo.quality.thumbnail
source: thumbnail
de: Vorschau
es: miniatura
fr: miniature
it: miniatura
ja: サムネイル
ko: 섬네일
ru: миниатюра
zh_hans: 缩略图
zh_hant: 縮圖

source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
ja: はい
ko: 예
ru: Да
zh_hans: 是的
zh_hant: 是的

source: (System)
es: (Sistema)
fr: (Système)
it: (Sistema)
ja: (システム)
ko: (시스템)
ru: (Система)
zh_hans: (系统截图)
zh_hant: (系統截圖)

source: API URL
es: URL API
fr: URL API
it: URL API
ru: URL API
zh_hans: API 地址
zh_hant: API 地址

source: Branch
es: Rama
fr: Branche
ja: ブランチ
ko: 브랜치
ru: Ветка
zh_hans: 分支
zh_hant: 分支

source: Domain
es: Dominio
fr: Domaine
it: Dominio
ja: ドメイン
ko: 도메인
ru: Домен
zh_hans: 域名
zh_hant: 網域名稱

source: domain:https://xxx.com
es: dominio:https://xxx.com
fr: domaine:https://xxx.com
it: dominio:https://xxx.com
zh_hans: 访问域名:https://xxx.com
zh_hant: 訪問域名:https://xxx.com

source: Email
es: Correo electrónico
ja: メール
ko: 이메일
ru: Электронная почта
zh_hans: 邮箱
zh_hant: 電子郵件

source: Operator
es: Operador
fr: Opérateur
it: Operatore
ja: オペレーター
ko: 운영자
ru: Оператор
zh_hans: 操作员
zh_hant: 操作員

source: Operator name
es: Nombre Operador
fr: Nom Opérateur
it: Nome Operatore
ja: オペレーター名
ko: 운영자 이름
ru: Имя оператора
zh_hans: 操作员名称
zh_hant: 操作員名稱

source: Region
es: Región
fr: Région
it: Regione
ja: リージョン
ko: 리전
ru: Регион
zh_hans: 区域
zh_hant: 區域

source: Save Key
es: Guardar Key
fr: Sauvegarder Key
it: Salva Key
ja: キーを保存
ko: 키 저장
ru: Сохранить ключ
zh_hans: 保存路径
zh_hant: 保存路徑

source: URL suffix
es: Sufijo URL
fr: Suffixe URL
it: Suffisso URL
ja: URLサフィックス
ko: URL 접미사
ru: Суффикс URL
zh_hans: 网址后缀
zh_hant: 網址後綴

source: Version
es: Versión
it: Versione
ja: バージョン
ko: 버전
ru: Версия
zh_hans: 版本
zh_hant: 版本

source: Host
fr: Hôte
ja: ホスト
ko: 호스트
ru: Хост
zh_hans: 图床
zh_hant: 圖床

# weibo.quality.large
source: original
it: originale
ja: オリジナル
ko: 원본
ru: оригинал
zh_hans: 原图
zh_hant: 原始圖片

source: Bucket
ja: バケット
ko: 버킷
ru: Бакет
zh_hans: 空间名称
zh_hant: 存儲桶名稱

source: Headers
ja: ヘッダー
ko: 헤더
zh_hans: 请求头
zh_hant: 請求標頭

source: Repo
ja: リポジトリ
ko: 저장소
ru: Репозиторий
zh_hans: 仓库名
zh_hant: 倉庫名

source: OK
ko: 확인
zh_hans: 好
zh_hant: 好

# host.type.gitee
source: Gitee
zh_hans: 码云 Gitee
zh_hant: 碼雲 Gitee

# host.type.qiniu_kodo
source: Qiniu KODO
zh_hans: 七牛云 KODO
zh_hant: 七牛雲 KODO

# host.type.upyun_uss
source: Upyun USS
zh_hans: 又拍云 USS
zh_hant: 又拍雲 USS

# host.type.weibo
source: Weibo
zh_hans: 微博
zh_hant: 微博
